"""
기준점을 잘잡아야 한다.

1. 방향*회전 가짓수 2개
2. 방향*회전 가짓수 1개
3. 방향*회전 가짓수 8개
4. 방향*회전 가짓수 4개
5. 방향*회전 가짓수 4개
"""
import sys
input = sys.stdin.readline

n, m = [int(i) for i in input().split()]
data = [[int(i) for i in input().split()] for _ in range(n)]

types = [
    [(0,0),(0,1),(0,2),(0,3)], # 1번 블록 2가지
    [(0,0),(1,0),(2,0),(3,0)],
    [(0,0),(1,0),(1,1),(0,1)], # 2번 블록 1가지
    [(0,0),(1,0),(2,0),(2,1)], # 3번 블록 8가지
    [(0,0),(0,1),(0,2),(-1,2)],
    [(0,0),(0,1),(1,1),(2,1)], 
    [(0,0),(1,0),(0,1),(0,2)],
    [(0,0),(1,0),(2,0),(2,-1)], 
    [(0,0),(1,0),(1,1),(1,2)],
    [(0,0),(0,1),(1,0),(2,0)], 
    [(0,0),(0,1),(0,2),(1,2)],
    [(0,0),(1,0),(1,1),(2,1)], # 4번 블록 4가지
    [(0,0),(0,1),(-1,1),(-1,2)],
    [(0,0),(1,0),(1,-1),(2,-1)],
    [(0,0),(0,1),(1,1),(1,2)],
    [(0,0),(-1,-1),(-1,0),(-1,1)], # 5번 블록 4가지
    [(0,0),(-1,1),(0,1),(1,1)],
    [(0,0),(1,-1),(1,0),(1,1)],
    [(0,0),(-1,-1),(0,-1),(1,-1)]
]

answer = 0
for i in range(n):
    for j in range(m):
        for ty in types:
            res = 0
            for t in ty:
                a,b = t
                ni,nj = i+a, j+b
                if 0 <= ni < n and 0 <= nj < m:
                    res += data[ni][nj]
                else:
                    res = -1
                    break
            if res >= 0:
                answer = max(answer, res)
print(answer)